print("안녕하세요"[0]) #0부터 시작 
print("안녕하세요"[1])
print("안녕하세요"[2])
print("안녕하세요"[3])
print("안녕하세요"[4])
print()
print("안녕하세요"[-1]) #음수는 -1부터 시작 -1이 제일왼쪽 단어
print("안녕하세요"[-2])
print("안녕하세요"[-3])
print("안녕하세요"[-4])
print("안녕하세요"[-5])
print()
print("안녕하세요"[1:4])#4 앞 자리 문자까지 표시
print()
print("안녕하세요"[0:2])
print("안녕하세요"[:2]) #0 안써도 시작부터 2까지 
print()
print("안녕하세요"[1:]) #1부터 끝까지
print("안녕하세요"[1:5])
print()
print(len("안녕하세요")) #문자열 길이 구하는 함수
print()
print("# 연습 문제")
print("\\\\\\\\")
print("-" *8)
print()
print("안녕하세요"[1]) 
print("안녕하세요"[2])
print("안녕하세요"[3])
print("안녕하세요"[4])
print("안녕하세요"[4])

print("안녕하세요"[1:3])
print("안녕하세요"[2:4])
print("안녕하세요"[1:])
print("안녕하세요"[:3])